
channel_id = {
    '电影': {'channel_id': 1, 'channel': 'tv', '': {'喜剧片': 8, '爱情片': 6, '动作片': 11, '科幻': 9, '恐怖片': 10, '战争片': 7}},
    '电视剧': {'channel_id': 2, 'channel': 'tv', '': {'国产剧': 15, '港剧': 16, '台剧': 1117, '韩剧': 17, '日剧': 309, '美剧': 18, '英国剧': 28916, '泰国剧': 1114}},
    '纪录片': {'channel_id': 3},
    '动漫': {'channel_id': 4, 'three_category_id': {'国产': 37, '韩': 1106, '日': 38, '欧美': 30281}},
    '综艺': {'channel_id': 6, 'three_category_id': {'内地': 151, '韩': 33306, '港台': 152, '欧美': 154}},
    '资讯': {'channel_id': 25},
}

channel_ids = {
    '1': {'channel': 'movie', 'itype': {'7': 100004, '8': 100005, '6': 100061, '9': 100012, '10': 100007, '12': 100006, '11': 100018}},
    '2': {'channel': 'tv', 'iarea': {'13': 814, '14': [14, 817], '15': [10, 818], '16': [815, 816], '24': 9}},
    '23': {'channel': 'doco', 'itrailer':{'0': -1}},
    '4': {'channel': 'cartoon', 'iarea': {'19': 1, '20': 2, '22': 3}},
    '3': {'channel': 'variety', 'iarea': {'25': 1, '28': 2}},  # 国内和海外
    # '5': {'channel': 25, 'iarea': {'0': ''}},
}




